garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q24.inc
// Register: TU16ATMRH
#define TU16ATMRH TU16ATMRH
TU16ATMRH                                equ 03A2h
// bitfield definitions
TU16ATMRH_TMRH_POSN                      equ 0000h
TU16ATMRH_TMRH_POSITION                  equ 0000h
TU16ATMRH_TMRH_SIZE                      equ 0008h
TU16ATMRH_TMRH_LENGTH                    equ 0008h
TU16ATMRH_TMRH_MASK                      equ 00FFh
TU16ATMRH_TMRH0_POSN                     equ 0000h
TU16ATMRH_TMRH0_POSITION                 equ 0000h
TU16ATMRH_TMRH0_SIZE                     equ 0001h
TU16ATMRH_TMRH0_LENGTH                   equ 0001h
TU16ATMRH_TMRH0_MASK                     equ 0001h
TU16ATMRH_TMRH1_POSN                     equ 0001h
TU16ATMRH_TMRH1_POSITION                 equ 0001h
TU16ATMRH_TMRH1_SIZE                     equ 0001h
TU16ATMRH_TMRH1_LENGTH                   equ 0001h
TU16ATMRH_TMRH1_MASK                     equ 0002h
TU16ATMRH_TMRH2_POSN                     equ 0002h
TU16ATMRH_TMRH2_POSITION                 equ 0002h
TU16ATMRH_TMRH2_SIZE                     equ 0001h
TU16ATMRH_TMRH2_LENGTH                   equ 0001h
TU16ATMRH_TMRH2_MASK                     equ 0004h
TU16ATMRH_TMRH3_POSN                     equ 0003h
TU16ATMRH_TMRH3_POSITION                 equ 0003h
TU16ATMRH_TMRH3_SIZE                     equ 0001h
TU16ATMRH_TMRH3_LENGTH                   equ 0001h
TU16ATMRH_TMRH3_MASK                     equ 0008h
TU16ATMRH_TMRH4_POSN                     equ 0004h
TU16ATMRH_TMRH4_POSITION                 equ 0004h
TU16ATMRH_TMRH4_SIZE                     equ 0001h
TU16ATMRH_TMRH4_LENGTH                   equ 0001h
TU16ATMRH_TMRH4_MASK                     equ 0010h
TU16ATMRH_TMRH5_POSN                     equ 0005h
TU16ATMRH_TMRH5_POSITION                 equ 0005h
TU16ATMRH_TMRH5_SIZE                     equ 0001h
TU16ATMRH_TMRH5_LENGTH                   equ 0001h
TU16ATMRH_TMRH5_MASK                     equ 0020h
TU16ATMRH_TMRH6_POSN                     equ 0006h
TU16ATMRH_TMRH6_POSITION                 equ 0006h
TU16ATMRH_TMRH6_SIZE                     equ 0001h
TU16ATMRH_TMRH6_LENGTH                   equ 0001h
TU16ATMRH_TMRH6_MASK                     equ 0040h
TU16ATMRH_TMRH7_POSN                     equ 0007h
TU16ATMRH_TMRH7_POSITION                 equ 0007h
TU16ATMRH_TMRH7_SIZE                     equ 0001h
TU16ATMRH_TMRH7_LENGTH                   equ 0001h
TU16ATMRH_TMRH7_MASK                     equ 0080h
TU16ATMRH_TU16ATMRH0_POSN                equ 0000h
TU16ATMRH_TU16ATMRH0_POSITION            equ 0000h
TU16ATMRH_TU16ATMRH0_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH0_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH0_MASK                equ 0001h
TU16ATMRH_TU16ATMRH1_POSN                equ 0001h
TU16ATMRH_TU16ATMRH1_POSITION            equ 0001h
TU16ATMRH_TU16ATMRH1_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH1_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH1_MASK                equ 0002h
TU16ATMRH_TU16ATMRH2_POSN                equ 0002h
TU16ATMRH_TU16ATMRH2_POSITION            equ 0002h
TU16ATMRH_TU16ATMRH2_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH2_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH2_MASK                equ 0004h
TU16ATMRH_TU16ATMRH3_POSN                equ 0003h
TU16ATMRH_TU16ATMRH3_POSITION            equ 0003h
TU16ATMRH_TU16ATMRH3_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH3_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH3_MASK                equ 0008h
TU16ATMRH_TU16ATMRH4_POSN                equ 0004h
TU16ATMRH_TU16ATMRH4_POSITION            equ 0004h
TU16ATMRH_TU16ATMRH4_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH4_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH4_MASK                equ 0010h
TU16ATMRH_TU16ATMRH5_POSN                equ 0005h
TU16ATMRH_TU16ATMRH5_POSITION            equ 0005h
TU16ATMRH_TU16ATMRH5_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH5_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH5_MASK                equ 0020h
TU16ATMRH_TU16ATMRH6_POSN                equ 0006h
TU16ATMRH_TU16ATMRH6_POSITION            equ 0006h
TU16ATMRH_TU16ATMRH6_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH6_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH6_MASK                equ 0040h
TU16ATMRH_TU16ATMRH7_POSN                equ 0007h
TU16ATMRH_TU16ATMRH7_POSITION            equ 0007h
TU16ATMRH_TU16ATMRH7_SIZE                equ 0001h
TU16ATMRH_TU16ATMRH7_LENGTH              equ 0001h
TU16ATMRH_TU16ATMRH7_MASK                equ 0080h
TU16ATMRH_TU16ATMR8_POSN                 equ 0000h
TU16ATMRH_TU16ATMR8_POSITION             equ 0000h
TU16ATMRH_TU16ATMR8_SIZE                 equ 0001h
TU16ATMRH_TU16ATMR8_LENGTH               equ 0001h
TU16ATMRH_TU16ATMR8_MASK                 equ 0001h
TU16ATMRH_TU16ATMR9_POSN                 equ 0001h
TU16ATMRH_TU16ATMR9_POSITION             equ 0001h
TU16ATMRH_TU16ATMR9_SIZE                 equ 0001h
TU16ATMRH_TU16ATMR9_LENGTH               equ 0001h
TU16ATMRH_TU16ATMR9_MASK                 equ 0002h
TU16ATMRH_TU16ATMR10_POSN                equ 0002h
TU16ATMRH_TU16ATMR10_POSITION            equ 0002h
TU16ATMRH_TU16ATMR10_SIZE                equ 0001h
TU16ATMRH_TU16ATMR10_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR10_MASK                equ 0004h
TU16ATMRH_TU16ATMR11_POSN                equ 0003h
TU16ATMRH_TU16ATMR11_POSITION            equ 0003h
TU16ATMRH_TU16ATMR11_SIZE                equ 0001h
TU16ATMRH_TU16ATMR11_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR11_MASK                equ 0008h
TU16ATMRH_TU16ATMR12_POSN                equ 0004h
TU16ATMRH_TU16ATMR12_POSITION            equ 0004h
TU16ATMRH_TU16ATMR12_SIZE                equ 0001h
TU16ATMRH_TU16ATMR12_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR12_MASK                equ 0010h
TU16ATMRH_TU16ATMR13_POSN                equ 0005h
TU16ATMRH_TU16ATMR13_POSITION            equ 0005h
TU16ATMRH_TU16ATMR13_SIZE                equ 0001h
TU16ATMRH_TU16ATMR13_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR13_MASK                equ 0020h
TU16ATMRH_TU16ATMR14_POSN                equ 0006h
TU16ATMRH_TU16ATMR14_POSITION            equ 0006h
TU16ATMRH_TU16ATMR14_SIZE                equ 0001h
TU16ATMRH_TU16ATMR14_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR14_MASK                equ 0040h
TU16ATMRH_TU16ATMR15_POSN                equ 0007h
TU16ATMRH_TU16ATMR15_POSITION            equ 0007h
TU16ATMRH_TU16ATMR15_SIZE                equ 0001h
TU16ATMRH_TU16ATMR15_LENGTH              equ 0001h
TU16ATMRH_TU16ATMR15_MASK                equ 0080h

// Register: TU16ACRH
#define TU16ACRH TU16ACRH
TU16ACRH                                 equ 03A2h
// bitfield definitions
TU16ACRH_CRH_POSN                        equ 0000h
TU16ACRH_CRH_POSITION                    equ 0000h
TU16ACRH_CRH_SIZE                        equ 0008h
TU16ACRH_CRH_LENGTH                      equ 0008h
TU16ACRH_CRH_MASK                        equ 00FFh
TU16ACRH_CRH0_POSN                       equ 0000h
TU16ACRH_CRH0_POSITION                   equ 0000h
TU16ACRH_CRH0_SIZE                       equ 0001h
TU16ACRH_CRH0_LENGTH                     equ 0001h
TU16ACRH_CRH0_MASK                       equ 0001h
TU16ACRH_CRH1_POSN                       equ 0001h
TU16ACRH_CRH1_POSITION                   equ 0001h
TU16ACRH_CRH1_SIZE                       equ 0001h
TU16ACRH_CRH1_LENGTH                     equ 0001h
TU16ACRH_CRH1_MASK                       equ 0002h
TU16ACRH_CRH2_POSN                       equ 0002h
TU16ACRH_CRH2_POSITION                   equ 0002h
TU16ACRH_CRH2_SIZE                       equ 0001h
TU16ACRH_CRH2_LENGTH                     equ 0001h
TU16ACRH_CRH2_MASK                       equ 0004h
TU16ACRH_CRH3_POSN                       equ 0003h
TU16ACRH_CRH3_POSITION                   equ 0003h
TU16ACRH_CRH3_SIZE                       equ 0001h
TU16ACRH_CRH3_LENGTH                     equ 0001h
TU16ACRH_CRH3_MASK                       equ 0008h
TU16ACRH_CRH4_POSN                       equ 0004h
TU16ACRH_CRH4_POSITION                   equ 0004h
TU16ACRH_CRH4_SIZE                       equ 0001h
TU16ACRH_CRH4_LENGTH                     equ 0001h
TU16ACRH_CRH4_MASK                       equ 0010h
TU16ACRH_CRH5_POSN                       equ 0005h
TU16ACRH_CRH5_POSITION                   equ 0005h
TU16ACRH_CRH5_SIZE                       equ 0001h
TU16ACRH_CRH5_LENGTH                     equ 0001h
TU16ACRH_CRH5_MASK                       equ 0020h
TU16ACRH_CRH6_POSN                       equ 0006h
TU16ACRH_CRH6_POSITION                   equ 0006h
TU16ACRH_CRH6_SIZE                       equ 0001h
TU16ACRH_CRH6_LENGTH                     equ 0001h
TU16ACRH_CRH6_MASK                       equ 0040h
TU16ACRH_CRH7_POSN                       equ 0007h
TU16ACRH_CRH7_POSITION                   equ 0007h
TU16ACRH_CRH7_SIZE                       equ 0001h
TU16ACRH_CRH7_LENGTH                     equ 0001h
TU16ACRH_CRH7_MASK                       equ 0080h
TU16ACRH_TU16ACRH0_POSN                  equ 0000h
TU16ACRH_TU16ACRH0_POSITION              equ 0000h
TU16ACRH_TU16ACRH0_SIZE                  equ 0001h
TU16ACRH_TU16ACRH0_LENGTH                equ 0001h
TU16ACRH_TU16ACRH0_MASK                  equ 0001h
TU16ACRH_TU16ACRH1_POSN                  equ 0001h
TU16ACRH_TU16ACRH1_POSITION              equ 0001h
TU16ACRH_TU16ACRH1_SIZE                  equ 0001h
TU16ACRH_TU16ACRH1_LENGTH                equ 0001h
TU16ACRH_TU16ACRH1_MASK                  equ 0002h
TU16ACRH_TU16ACRH2_POSN                  equ 0002h
TU16ACRH_TU16ACRH2_POSITION              equ 0002h
TU16ACRH_TU16ACRH2_SIZE                  equ 0001h
TU16ACRH_TU16ACRH2_LENGTH                equ 0001h
TU16ACRH_TU16ACRH2_MASK                  equ 0004h
TU16ACRH_TU16ACRH3_POSN                  equ 0003h
TU16ACRH_TU16ACRH3_POSITION              equ 0003h
TU16ACRH_TU16ACRH3_SIZE                  equ 0001h
TU16ACRH_TU16ACRH3_LENGTH                equ 0001h
TU16ACRH_TU16ACRH3_MASK                  equ 0008h
TU16ACRH_TU16ACRH4_POSN                  equ 0004h
TU16ACRH_TU16ACRH4_POSITION              equ 0004h
TU16ACRH_TU16ACRH4_SIZE                  equ 0001h
TU16ACRH_TU16ACRH4_LENGTH                equ 0001h
TU16ACRH_TU16ACRH4_MASK                  equ 0010h
TU16ACRH_TU16ACRH5_POSN                  equ 0005h
TU16ACRH_TU16ACRH5_POSITION              equ 0005h
TU16ACRH_TU16ACRH5_SIZE                  equ 0001h
TU16ACRH_TU16ACRH5_LENGTH                equ 0001h
TU16ACRH_TU16ACRH5_MASK                  equ 0020h
TU16ACRH_TU16ACRH6_POSN                  equ 0006h
TU16ACRH_TU16ACRH6_POSITION              equ 0006h
TU16ACRH_TU16ACRH6_SIZE                  equ 0001h
TU16ACRH_TU16ACRH6_LENGTH                equ 0001h
TU16ACRH_TU16ACRH6_MASK                  equ 0040h
TU16ACRH_TU16ACRH7_POSN                  equ 0007h
TU16ACRH_TU16ACRH7_POSITION              equ 0007h
TU16ACRH_TU16ACRH7_SIZE                  equ 0001h
TU16ACRH_TU16ACRH7_LENGTH                equ 0001h
TU16ACRH_TU16ACRH7_MASK                  equ 0080h
TU16ACRH_TU16ACR8_POSN                   equ 0000h
TU16ACRH_TU16ACR8_POSITION               equ 0000h
TU16ACRH_TU16ACR8_SIZE                   equ 0001h
TU16ACRH_TU16ACR8_LENGTH                 equ 0001h
TU16ACRH_TU16ACR8_MASK                   equ 0001h
TU16ACRH_TU16ACR9_POSN                   equ 0001h
TU16ACRH_TU16ACR9_POSITION               equ 0001h
TU16ACRH_TU16ACR9_SIZE                   equ 0001h
TU16ACRH_TU16ACR9_LENGTH                 equ 0001h
TU16ACRH_TU16ACR9_MASK                   equ 0002h
TU16ACRH_TU16ACR10_POSN                  equ 0002h
TU16ACRH_TU16ACR10_POSITION              equ 0002h
TU16ACRH_TU16ACR10_SIZE                  equ 0001h
TU16ACRH_TU16ACR10_LENGTH                equ 0001h
TU16ACRH_TU16ACR10_MASK                  equ 0004h
TU16ACRH_TU16ACR11_POSN                  equ 0003h
TU16ACRH_TU16ACR11_POSITION              equ 0003h
TU16ACRH_TU16ACR11_SIZE                  equ 0001h
TU16ACRH_TU16ACR11_LENGTH                equ 0001h
TU16ACRH_TU16ACR11_MASK                  equ 0008h
TU16ACRH_TU16ACR12_POSN                  equ 0004h
TU16ACRH_TU16ACR12_POSITION              equ 0004h
TU16ACRH_TU16ACR12_SIZE                  equ 0001h
TU16ACRH_TU16ACR12_LENGTH                equ 0001h
TU16ACRH_TU16ACR12_MASK                  equ 0010h
TU16ACRH_TU16ACR13_POSN                  equ 0005h
TU16ACRH_TU16ACR13_POSITION              equ 0005h
TU16ACRH_TU16ACR13_SIZE                  equ 0001h
TU16ACRH_TU16ACR13_LENGTH                equ 0001h
TU16ACRH_TU16ACR13_MASK                  equ 0020h
TU16ACRH_TU16ACR14_POSN                  equ 0006h
TU16ACRH_TU16ACR14_POSITION              equ 0006h
TU16ACRH_TU16ACR14_SIZE                  equ 0001h
TU16ACRH_TU16ACR14_LENGTH                equ 0001h
TU16ACRH_TU16ACR14_MASK                  equ 0040h
TU16ACRH_TU16ACR15_POSN                  equ 0007h
TU16ACRH_TU16ACR15_POSITION              equ 0007h
TU16ACRH_TU16ACR15_SIZE                  equ 0001h
TU16ACRH_TU16ACR15_LENGTH                equ 0001h
TU16ACRH_TU16ACR15_MASK                  equ 0080h

// Register: TU16ATMRT
#define TU16ATMRT TU16ATMRT
TU16ATMRT                                equ 03A4h
// bitfield definitions
TU16ATMRT_TMRT_POSN                      equ 0000h
TU16ATMRT_TMRT_POSITION                  equ 0000h
TU16ATMRT_TMRT_SIZE                      equ 0008h
TU16ATMRT_TMRT_LENGTH                    equ 0008h
TU16ATMRT_TMRT_MASK                      equ 00FFh
TU16ATMRT_TMRT0_POSN                     equ 0000h
TU16ATMRT_TMRT0_POSITION                 equ 0000h
TU16ATMRT_TMRT0_SIZE                     equ 0001h
TU16ATMRT_TMRT0_LENGTH                   equ 0001h
TU16ATMRT_TMRT0_MASK                     equ 0001h
TU16ATMRT_TMRT1_POSN                     equ 0001h
TU16ATMRT_TMRT1_POSITION                 equ 0001h
TU16ATMRT_TMRT1_SIZE                     equ 0001h
TU16ATMRT_TMRT1_LENGTH                   equ 0001h
TU16ATMRT_TMRT1_MASK                     equ 0002h
TU16ATMRT_TMRT2_POSN                     equ 0002h
TU16ATMRT_TMRT2_POSITION                 equ 0002h
TU16ATMRT_TMRT2_SIZE                     equ 0001h
TU16ATMRT_TMRT2_LENGTH                   equ 0001h
TU16ATMRT_TMRT2_MASK                     equ 0004h
TU16ATMRT_TMRT3_POSN                     equ 0003h
TU16ATMRT_TMRT3_POSITION                 equ 0003h
TU16ATMRT_TMRT3_SIZE                     equ 0001h
TU16ATMRT_TMRT3_LENGTH                   equ 0001h
TU16ATMRT_TMRT3_MASK                     equ 0008h
TU16ATMRT_TMRT4_POSN                     equ 0004h
TU16ATMRT_TMRT4_POSITION                 equ 0004h
TU16ATMRT_TMRT4_SIZE                     equ 0001h
TU16ATMRT_TMRT4_LENGTH                   equ 0001h
TU16ATMRT_TMRT4_MASK                     equ 0010h
TU16ATMRT_TMRT5_POSN                     equ 0005h
TU16ATMRT_TMRT5_POSITION                 equ 0005h
TU16ATMRT_TMRT5_SIZE                     equ 0001h
TU16ATMRT_TMRT5_LENGTH                   equ 0001h
TU16ATMRT_TMRT5_MASK                     equ 0020h
TU16ATMRT_TMRT6_POSN                     equ 0006h
TU16ATMRT_TMRT6_POSITION                 equ 0006h
TU16ATMRT_TMRT6_SIZE                     equ 0001h
TU16ATMRT_TMRT6_LENGTH                   equ 0001h
TU16ATMRT_TMRT6_MASK                     equ 0040h
TU16ATMRT_TMRT7_POSN                     equ 0007h
TU16ATMRT_TMRT7_POSITION                 equ 0007h
TU16ATMRT_TMRT7_SIZE                     equ 0001h
TU16ATMRT_TMRT7_LENGTH                   equ 0001h
TU16ATMRT_TMRT7_MASK                     equ 0080h
TU16ATMRT_TU16ATMRT0_POSN                equ 0000h
TU16ATMRT_TU16ATMRT0_POSITION            equ 0000h
TU16ATMRT_TU16ATMRT0_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT0_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT0_MASK                equ 0001h
TU16ATMRT_TU16ATMRT1_POSN                equ 0001h
TU16ATMRT_TU16ATMRT1_POSITION            equ 0001h
TU16ATMRT_TU16ATMRT1_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT1_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT1_MASK                equ 0002h
TU16ATMRT_TU16ATMRT2_POSN                equ 0002h
TU16ATMRT_TU16ATMRT2_POSITION            equ 0002h
TU16ATMRT_TU16ATMRT2_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT2_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT2_MASK                equ 0004h
TU16ATMRT_TU16ATMRT3_POSN                equ 0003h
TU16ATMRT_TU16ATMRT3_POSITION            equ 0003h
TU16ATMRT_TU16ATMRT3_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT3_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT3_MASK                equ 0008h
TU16ATMRT_TU16ATMRT4_POSN                equ 0004h
TU16ATMRT_TU16ATMRT4_POSITION            equ 0004h
TU16ATMRT_TU16ATMRT4_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT4_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT4_MASK                equ 0010h
TU16ATMRT_TU16ATMRT5_POSN                equ 0005h
TU16ATMRT_TU16ATMRT5_POSITION            equ 0005h
TU16ATMRT_TU16ATMRT5_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT5_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT5_MASK                equ 0020h
TU16ATMRT_TU16ATMRT6_POSN                equ 0006h
TU16ATMRT_TU16ATMRT6_POSITION            equ 0006h
TU16ATMRT_TU16ATMRT6_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT6_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT6_MASK                equ 0040h
TU16ATMRT_TU16ATMRT7_POSN                equ 0007h
TU16ATMRT_TU16ATMRT7_POSITION            equ 0007h
TU16ATMRT_TU16ATMRT7_SIZE                equ 0001h
TU16ATMRT_TU16ATMRT7_LENGTH              equ 0001h
TU16ATMRT_TU16ATMRT7_MASK                equ 0080h
TU16ATMRT_TU16ATMR24_POSN                equ 0000h
TU16ATMRT_TU16ATMR24_POSITION            equ 0000h
TU16ATMRT_TU16ATMR24_SIZE                equ 0001h
TU16ATMRT_TU16ATMR24_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR24_MASK                equ 0001h
TU16ATMRT_TU16ATMR25_POSN                equ 0001h
TU16ATMRT_TU16ATMR25_POSITION            equ 0001h
TU16ATMRT_TU16ATMR25_SIZE                equ 0001h
TU16ATMRT_TU16ATMR25_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR25_MASK                equ 0002h
TU16ATMRT_TU16ATMR26_POSN                equ 0002h
TU16ATMRT_TU16ATMR26_POSITION            equ 0002h
TU16ATMRT_TU16ATMR26_SIZE                equ 0001h
TU16ATMRT_TU16ATMR26_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR26_MASK                equ 0004h
TU16ATMRT_TU16ATMR27_POSN                equ 0003h
TU16ATMRT_TU16ATMR27_POSITION            equ 0003h
TU16ATMRT_TU16ATMR27_SIZE                equ 0001h
TU16ATMRT_TU16ATMR27_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR27_MASK                equ 0008h
TU16ATMRT_TU16ATMR28_POSN                equ 0004h
TU16ATMRT_TU16ATMR28_POSITION            equ 0004h
TU16ATMRT_TU16ATMR28_SIZE                equ 0001h
TU16ATMRT_TU16ATMR28_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR28_MASK                equ 0010h
TU16ATMRT_TU16ATMR29_POSN                equ 0005h
TU16ATMRT_TU16ATMR29_POSITION            equ 0005h
TU16ATMRT_TU16ATMR29_SIZE                equ 0001h
TU16ATMRT_TU16ATMR29_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR29_MASK                equ 0020h
TU16ATMRT_TU16ATMR30_POSN                equ 0006h
TU16ATMRT_TU16ATMR30_POSITION            equ 0006h
TU16ATMRT_TU16ATMR30_SIZE                equ 0001h
TU16ATMRT_TU16ATMR30_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR30_MASK                equ 0040h
TU16ATMRT_TU16ATMR31_POSN                equ 0007h
TU16ATMRT_TU16ATMR31_POSITION            equ 0007h
TU16ATMRT_TU16ATMR31_SIZE                equ 0001h
TU16ATMRT_TU16ATMR31_LENGTH              equ 0001h
TU16ATMRT_TU16ATMR31_MASK                equ 0080h

