garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q24.inc
// Register: SLRCOND
#define SLRCOND SLRCOND
SLRCOND                                  equ 041Bh
// bitfield definitions
SLRCOND_SLRD0_POSN                       equ 0000h
SLRCOND_SLRD0_POSITION                   equ 0000h
SLRCOND_SLRD0_SIZE                       equ 0001h
SLRCOND_SLRD0_LENGTH                     equ 0001h
SLRCOND_SLRD0_MASK                       equ 0001h
SLRCOND_SLRD1_POSN                       equ 0001h
SLRCOND_SLRD1_POSITION                   equ 0001h
SLRCOND_SLRD1_SIZE                       equ 0001h
SLRCOND_SLRD1_LENGTH                     equ 0001h
SLRCOND_SLRD1_MASK                       equ 0002h
SLRCOND_SLRD2_POSN                       equ 0002h
SLRCOND_SLRD2_POSITION                   equ 0002h
SLRCOND_SLRD2_SIZE                       equ 0001h
SLRCOND_SLRD2_LENGTH                     equ 0001h
SLRCOND_SLRD2_MASK                       equ 0004h
SLRCOND_SLRD3_POSN                       equ 0003h
SLRCOND_SLRD3_POSITION                   equ 0003h
SLRCOND_SLRD3_SIZE                       equ 0001h
SLRCOND_SLRD3_LENGTH                     equ 0001h
SLRCOND_SLRD3_MASK                       equ 0008h
SLRCOND_SLRD4_POSN                       equ 0004h
SLRCOND_SLRD4_POSITION                   equ 0004h
SLRCOND_SLRD4_SIZE                       equ 0001h
SLRCOND_SLRD4_LENGTH                     equ 0001h
SLRCOND_SLRD4_MASK                       equ 0010h
SLRCOND_SLRD5_POSN                       equ 0005h
SLRCOND_SLRD5_POSITION                   equ 0005h
SLRCOND_SLRD5_SIZE                       equ 0001h
SLRCOND_SLRD5_LENGTH                     equ 0001h
SLRCOND_SLRD5_MASK                       equ 0020h
SLRCOND_SLRD6_POSN                       equ 0006h
SLRCOND_SLRD6_POSITION                   equ 0006h
SLRCOND_SLRD6_SIZE                       equ 0001h
SLRCOND_SLRD6_LENGTH                     equ 0001h
SLRCOND_SLRD6_MASK                       equ 0040h
SLRCOND_SLRD7_POSN                       equ 0007h
SLRCOND_SLRD7_POSITION                   equ 0007h
SLRCOND_SLRD7_SIZE                       equ 0001h
SLRCOND_SLRD7_LENGTH                     equ 0001h
SLRCOND_SLRD7_MASK                       equ 0080h

// Register: INLVLD
#define INLVLD INLVLD
INLVLD                                   equ 041Ch
// bitfield definitions
INLVLD_INLVLD0_POSN                      equ 0000h
INLVLD_INLVLD0_POSITION                  equ 0000h
INLVLD_INLVLD0_SIZE                      equ 0001h
INLVLD_INLVLD0_LENGTH                    equ 0001h
INLVLD_INLVLD0_MASK                      equ 0001h
INLVLD_INLVLD1_POSN                      equ 0001h
INLVLD_INLVLD1_POSITION                  equ 0001h
INLVLD_INLVLD1_SIZE                      equ 0001h
INLVLD_INLVLD1_LENGTH                    equ 0001h
INLVLD_INLVLD1_MASK                      equ 0002h
INLVLD_INLVLD2_POSN                      equ 0002h
INLVLD_INLVLD2_POSITION                  equ 0002h
INLVLD_INLVLD2_SIZE                      equ 0001h
INLVLD_INLVLD2_LENGTH                    equ 0001h
INLVLD_INLVLD2_MASK                      equ 0004h
INLVLD_INLVLD3_POSN                      equ 0003h
INLVLD_INLVLD3_POSITION                  equ 0003h
INLVLD_INLVLD3_SIZE                      equ 0001h
INLVLD_INLVLD3_LENGTH                    equ 0001h
INLVLD_INLVLD3_MASK                      equ 0008h
INLVLD_INLVLD4_POSN                      equ 0004h
INLVLD_INLVLD4_POSITION                  equ 0004h
INLVLD_INLVLD4_SIZE                      equ 0001h
INLVLD_INLVLD4_LENGTH                    equ 0001h
INLVLD_INLVLD4_MASK                      equ 0010h
INLVLD_INLVLD5_POSN                      equ 0005h
INLVLD_INLVLD5_POSITION                  equ 0005h
INLVLD_INLVLD5_SIZE                      equ 0001h
INLVLD_INLVLD5_LENGTH                    equ 0001h
INLVLD_INLVLD5_MASK                      equ 0020h
INLVLD_INLVLD6_POSN                      equ 0006h
INLVLD_INLVLD6_POSITION                  equ 0006h
INLVLD_INLVLD6_SIZE                      equ 0001h
INLVLD_INLVLD6_LENGTH                    equ 0001h
INLVLD_INLVLD6_MASK                      equ 0040h
INLVLD_INLVLD7_POSN                      equ 0007h
INLVLD_INLVLD7_POSITION                  equ 0007h
INLVLD_INLVLD7_SIZE                      equ 0001h
INLVLD_INLVLD7_LENGTH                    equ 0001h
INLVLD_INLVLD7_MASK                      equ 0080h

// Register: IOCDP
#define IOCDP IOCDP
IOCDP                                    equ 041Dh
// bitfield definitions
IOCDP_IOCDP0_POSN                        equ 0000h
IOCDP_IOCDP0_POSITION                    equ 0000h
IOCDP_IOCDP0_SIZE                        equ 0001h
IOCDP_IOCDP0_LENGTH                      equ 0001h
IOCDP_IOCDP0_MASK                        equ 0001h
IOCDP_IOCDP1_POSN                        equ 0001h
IOCDP_IOCDP1_POSITION                    equ 0001h
IOCDP_IOCDP1_SIZE                        equ 0001h
IOCDP_IOCDP1_LENGTH                      equ 0001h
IOCDP_IOCDP1_MASK                        equ 0002h
IOCDP_IOCDP2_POSN                        equ 0002h
IOCDP_IOCDP2_POSITION                    equ 0002h
IOCDP_IOCDP2_SIZE                        equ 0001h
IOCDP_IOCDP2_LENGTH                      equ 0001h
IOCDP_IOCDP2_MASK                        equ 0004h
IOCDP_IOCDP3_POSN                        equ 0003h
IOCDP_IOCDP3_POSITION                    equ 0003h
IOCDP_IOCDP3_SIZE                        equ 0001h
IOCDP_IOCDP3_LENGTH                      equ 0001h
IOCDP_IOCDP3_MASK                        equ 0008h
IOCDP_IOCDP4_POSN                        equ 0004h
IOCDP_IOCDP4_POSITION                    equ 0004h
IOCDP_IOCDP4_SIZE                        equ 0001h
IOCDP_IOCDP4_LENGTH                      equ 0001h
IOCDP_IOCDP4_MASK                        equ 0010h
IOCDP_IOCDP5_POSN                        equ 0005h
IOCDP_IOCDP5_POSITION                    equ 0005h
IOCDP_IOCDP5_SIZE                        equ 0001h
IOCDP_IOCDP5_LENGTH                      equ 0001h
IOCDP_IOCDP5_MASK                        equ 0020h
IOCDP_IOCDP6_POSN                        equ 0006h
IOCDP_IOCDP6_POSITION                    equ 0006h
IOCDP_IOCDP6_SIZE                        equ 0001h
IOCDP_IOCDP6_LENGTH                      equ 0001h
IOCDP_IOCDP6_MASK                        equ 0040h
IOCDP_IOCDP7_POSN                        equ 0007h
IOCDP_IOCDP7_POSITION                    equ 0007h
IOCDP_IOCDP7_SIZE                        equ 0001h
IOCDP_IOCDP7_LENGTH                      equ 0001h
IOCDP_IOCDP7_MASK                        equ 0080h

// Register: IOCDN
#define IOCDN IOCDN
IOCDN                                    equ 041Eh
// bitfield definitions
IOCDN_IOCDN0_POSN                        equ 0000h
IOCDN_IOCDN0_POSITION                    equ 0000h
IOCDN_IOCDN0_SIZE                        equ 0001h
IOCDN_IOCDN0_LENGTH                      equ 0001h
IOCDN_IOCDN0_MASK                        equ 0001h
IOCDN_IOCDN1_POSN                        equ 0001h
IOCDN_IOCDN1_POSITION                    equ 0001h
IOCDN_IOCDN1_SIZE                        equ 0001h
IOCDN_IOCDN1_LENGTH                      equ 0001h
IOCDN_IOCDN1_MASK                        equ 0002h
IOCDN_IOCDN2_POSN                        equ 0002h
IOCDN_IOCDN2_POSITION                    equ 0002h
IOCDN_IOCDN2_SIZE                        equ 0001h
IOCDN_IOCDN2_LENGTH                      equ 0001h
IOCDN_IOCDN2_MASK                        equ 0004h
IOCDN_IOCDN3_POSN                        equ 0003h
IOCDN_IOCDN3_POSITION                    equ 0003h
IOCDN_IOCDN3_SIZE                        equ 0001h
IOCDN_IOCDN3_LENGTH                      equ 0001h
IOCDN_IOCDN3_MASK                        equ 0008h
IOCDN_IOCDN4_POSN                        equ 0004h
IOCDN_IOCDN4_POSITION                    equ 0004h
IOCDN_IOCDN4_SIZE                        equ 0001h
IOCDN_IOCDN4_LENGTH                      equ 0001h
IOCDN_IOCDN4_MASK                        equ 0010h
IOCDN_IOCDN5_POSN                        equ 0005h
IOCDN_IOCDN5_POSITION                    equ 0005h
IOCDN_IOCDN5_SIZE                        equ 0001h
IOCDN_IOCDN5_LENGTH                      equ 0001h
IOCDN_IOCDN5_MASK                        equ 0020h
IOCDN_IOCDN6_POSN                        equ 0006h
IOCDN_IOCDN6_POSITION                    equ 0006h
IOCDN_IOCDN6_SIZE                        equ 0001h
IOCDN_IOCDN6_LENGTH                      equ 0001h
IOCDN_IOCDN6_MASK                        equ 0040h
IOCDN_IOCDN7_POSN                        equ 0007h
IOCDN_IOCDN7_POSITION                    equ 0007h
IOCDN_IOCDN7_SIZE                        equ 0001h
IOCDN_IOCDN7_LENGTH                      equ 0001h
IOCDN_IOCDN7_MASK                        equ 0080h

// Register: IOCDF
#define IOCDF IOCDF
IOCDF                                    equ 041Fh
// bitfield definitions
IOCDF_IOCDF0_POSN                        equ 0000h
IOCDF_IOCDF0_POSITION                    equ 0000h
IOCDF_IOCDF0_SIZE                        equ 0001h
IOCDF_IOCDF0_LENGTH                      equ 0001h
IOCDF_IOCDF0_MASK                        equ 0001h
IOCDF_IOCDF1_POSN                        equ 0001h
IOCDF_IOCDF1_POSITION                    equ 0001h
IOCDF_IOCDF1_SIZE                        equ 0001h
IOCDF_IOCDF1_LENGTH                      equ 0001h
IOCDF_IOCDF1_MASK                        equ 0002h
IOCDF_IOCDF2_POSN                        equ 0002h
IOCDF_IOCDF2_POSITION                    equ 0002h
IOCDF_IOCDF2_SIZE                        equ 0001h
IOCDF_IOCDF2_LENGTH                      equ 0001h
IOCDF_IOCDF2_MASK                        equ 0004h
IOCDF_IOCDF3_POSN                        equ 0003h
IOCDF_IOCDF3_POSITION                    equ 0003h
IOCDF_IOCDF3_SIZE                        equ 0001h
IOCDF_IOCDF3_LENGTH                      equ 0001h
IOCDF_IOCDF3_MASK                        equ 0008h
IOCDF_IOCDF4_POSN                        equ 0004h
IOCDF_IOCDF4_POSITION                    equ 0004h
IOCDF_IOCDF4_SIZE                        equ 0001h
IOCDF_IOCDF4_LENGTH                      equ 0001h
IOCDF_IOCDF4_MASK                        equ 0010h
IOCDF_IOCDF5_POSN                        equ 0005h
IOCDF_IOCDF5_POSITION                    equ 0005h
IOCDF_IOCDF5_SIZE                        equ 0001h
IOCDF_IOCDF5_LENGTH                      equ 0001h
IOCDF_IOCDF5_MASK                        equ 0020h
IOCDF_IOCDF6_POSN                        equ 0006h
IOCDF_IOCDF6_POSITION                    equ 0006h
IOCDF_IOCDF6_SIZE                        equ 0001h
IOCDF_IOCDF6_LENGTH                      equ 0001h
IOCDF_IOCDF6_MASK                        equ 0040h
IOCDF_IOCDF7_POSN                        equ 0007h
IOCDF_IOCDF7_POSITION                    equ 0007h
IOCDF_IOCDF7_SIZE                        equ 0001h
IOCDF_IOCDF7_LENGTH                      equ 0001h
IOCDF_IOCDF7_MASK                        equ 0080h

