garyPenhook/PIC-Assembler/xc8/pic/include/proc/pic18f55q24.inc
#define LATF5                            BANKMASK(LATF), 5, b
#define LATF6                            BANKMASK(LATF), 6, b
#define LATF7                            BANKMASK(LATF), 7, b
#define LATW0                            BANKMASK(LATW), 0, b
#define LATW1                            BANKMASK(LATW), 1, b
#define LATW2                            BANKMASK(LATW), 2, b
#define LATW3                            BANKMASK(LATW), 3, b
#define LATW4                            BANKMASK(LATW), 4, b
#define LATW5                            BANKMASK(LATW), 5, b
#define LATW6                            BANKMASK(LATW), 6, b
#define LATW7                            BANKMASK(LATW), 7, b
#define LENDIAN                          BANKMASK(CRCCON0), 1, b
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LOCK                             BANKMASK(ACTCON), 3, b
#define LSAC0                            BANKMASK(CWG1AS0), 2, b
#define LSAC1                            BANKMASK(CWG1AS0), 3, b
#define LSBD0                            BANKMASK(CWG1AS0), 4, b
#define LSBD1                            BANKMASK(CWG1AS0), 5, b
#define LSCA1                            BANKMASK(CWG1AS0), 3, b
#define LSDB0                            BANKMASK(CWG1AS0), 4, b
#define LSDB1                            BANKMASK(CWG1AS0), 5, b
#define LTH0                             BANKMASK(ADLTHL), 0, b
#define LTH1                             BANKMASK(ADLTHL), 1, b
#define LTH10                            BANKMASK(ADLTHH), 2, b
#define LTH11                            BANKMASK(ADLTHH), 3, b
#define LTH12                            BANKMASK(ADLTHH), 4, b
#define LTH13                            BANKMASK(ADLTHH), 5, b
#define LTH14                            BANKMASK(ADLTHH), 6, b
#define LTH15                            BANKMASK(ADLTHH), 7, b
#define LTH2                             BANKMASK(ADLTHL), 2, b
#define LTH3                             BANKMASK(ADLTHL), 3, b
#define LTH4                             BANKMASK(ADLTHL), 4, b
#define LTH5                             BANKMASK(ADLTHL), 5, b
#define LTH6                             BANKMASK(ADLTHL), 6, b
#define LTH7                             BANKMASK(ADLTHL), 7, b
#define LTH8                             BANKMASK(ADLTHH), 0, b
#define LTH9                             BANKMASK(ADLTHH), 1, b
#define LTHR                             BANKMASK(ADSTAT), 5, b
#define LVDMD                            BANKMASK(PMD0), 5, b
#define LVDSTAT                          BANKMASK(VDDIO2CON), 6, b
#define MAINPR0                          BANKMASK(MAINPR), 0, b
#define MAINPR1                          BANKMASK(MAINPR), 1, b
#define MAINPR2                          BANKMASK(MAINPR), 2, b
#define MATH                             BANKMASK(ADSTAT), 4, b
#define MC1OUT                           BANKMASK(CMOUT), 0, b
#define MC2OUT                           BANKMASK(CMOUT), 1, b
#define MD0                              BANKMASK(ADCON2), 0, b
#define MD1                              BANKMASK(ADCON2), 1, b
#define MD16                             BANKMASK(T0CON0), 4, b
#define MD2                              BANKMASK(ADCON2), 2, b
#define MEMV                             BANKMASK(PCON1), 1, a
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MPWM1EN                          BANKMASK(PWMEN), 0, a
#define MPWM1LD                          BANKMASK(PWMLOAD), 0, a
#define MPWM2EN                          BANKMASK(PWMEN), 1, a
#define MPWM2LD                          BANKMASK(PWMLOAD), 1, a
#define MPWM3EN                          BANKMASK(PWMEN), 2, a
#define MPWM3LD                          BANKMASK(PWMLOAD), 2, a
#define MREG                             BANKMASK(SCANCON0), 2, b
#define NACK1IE                          BANKMASK(I2C1ERR), 0, b
#define NACK1IF                          BANKMASK(I2C1ERR), 4, b
#define NACK2IE                          BANKMASK(I2C2ERR), 0, b
#define NACK2IF                          BANKMASK(I2C2ERR), 4, b
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0, b
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1, b
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2, b
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3, b
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4, b
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5, b
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6, b
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7, b
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0, b
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1, b
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2, b
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3, b
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2, b
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3, b
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4, b
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5, b
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6, b
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7, b
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0, b
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1, b
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0, b
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1, b
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2, b
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3, b
#define NCO1CKS4                         BANKMASK(NCO1CLK), 4, b
#define NCO1EN                           BANKMASK(NCO1CON), 7, b
#define NCO1IE                           BANKMASK(PIE6), 3, a
#define NCO1IF                           BANKMASK(PIR6), 3, a
#define NCO1INC0                         BANKMASK(NCO1INCL), 0, b
#define NCO1INC1                         BANKMASK(NCO1INCL), 1, b
#define NCO1INC10                        BANKMASK(NCO1INCH), 2, b
#define NCO1INC11                        BANKMASK(NCO1INCH), 3, b
#define NCO1INC12                        BANKMASK(NCO1INCH), 4, b
#define NCO1INC13                        BANKMASK(NCO1INCH), 5, b
#define NCO1INC14                        BANKMASK(NCO1INCH), 6, b
#define NCO1INC15                        BANKMASK(NCO1INCH), 7, b
#define NCO1INC16                        BANKMASK(NCO1INCU), 0, b
#define NCO1INC17                        BANKMASK(NCO1INCU), 1, b
#define NCO1INC18                        BANKMASK(NCO1INCU), 2, b
#define NCO1INC19                        BANKMASK(NCO1INCU), 3, b
#define NCO1INC2                         BANKMASK(NCO1INCL), 2, b
#define NCO1INC3                         BANKMASK(NCO1INCL), 3, b
#define NCO1INC4                         BANKMASK(NCO1INCL), 4, b
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR6), 3, a
#define NCO1MD                           BANKMASK(PMD2), 4, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_HYS                          BANKMASK(VDDIO2CON), 4, b
#define NOT_IOMON                        BANKMASK(VDDIO2CON), 7, b
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, b
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NREF0                            BANKMASK(ADREF), 4, b
#define NSS0                             BANKMASK(DAC1CON), 0, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMGO                            BANKMASK(NVMCON0), 0, b
#define NVMIE                            BANKMASK(PIE0), 4, a
#define NVMIF                            BANKMASK(PIR0), 4, a
#define NVMIP                            BANKMASK(IPR0), 4, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCD0                            BANKMASK(ODCOND), 0, b
#define ODCD1                            BANKMASK(ODCOND), 1, b
#define ODCD2                            BANKMASK(ODCOND), 2, b
#define ODCD3                            BANKMASK(ODCOND), 3, b
#define ODCD4                            BANKMASK(ODCOND), 4, b
#define ODCD5                            BANKMASK(ODCOND), 5, b
#define ODCD6                            BANKMASK(ODCOND), 6, b
#define ODCD7                            BANKMASK(ODCOND), 7, b
#define ODCE0                            BANKMASK(ODCONE), 0, b
#define ODCE1                            BANKMASK(ODCONE), 1, b
#define ODCE2                            BANKMASK(ODCONE), 2, b
#define ODCF0                            BANKMASK(ODCONF), 0, b
#define ODCF1                            BANKMASK(ODCONF), 1, b
#define ODCF2                            BANKMASK(ODCONF), 2, b
#define ODCF3                            BANKMASK(ODCONF), 3, b
#define ODCF4                            BANKMASK(ODCONF), 4, b
#define ODCF5                            BANKMASK(ODCONF), 5, b
#define ODCF6                            BANKMASK(ODCONF), 6, b
#define ODCF7                            BANKMASK(ODCONF), 7, b
#define OE0                              BANKMASK(DAC1CON), 4, b
#define OE1                              BANKMASK(DAC1CON), 5, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, a
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PC2IE                            BANKMASK(I2C2PIE), 2, b
#define PC2IF                            BANKMASK(I2C2PIR), 2, b
#define PCSC                             BANKMASK(ADCON1), 1, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLEN4                            BANKMASK(CRCCON1), 4, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PORTWCLKPPS0                     BANKMASK(PORTWCLKPPS), 0, b
#define PORTWCLKPPS1                     BANKMASK(PORTWCLKPPS), 1, b
#define PORTWCLKPPS2                     BANKMASK(PORTWCLKPPS), 2, b
#define PORTWCLKPPS3                     BANKMASK(PORTWCLKPPS), 3, b
#define PORTWCLKPPS4                     BANKMASK(PORTWCLKPPS), 4, b
#define PORTWCLKPPS5                     BANKMASK(PORTWCLKPPS), 5, b
#define PORTWIN0PPS0                     BANKMASK(PORTWIN0PPS), 0, b
#define PORTWIN0PPS1                     BANKMASK(PORTWIN0PPS), 1, b
#define PORTWIN0PPS2                     BANKMASK(PORTWIN0PPS), 2, b
#define PORTWIN0PPS3                     BANKMASK(PORTWIN0PPS), 3, b
#define PORTWIN0PPS4                     BANKMASK(PORTWIN0PPS), 4, b
#define PORTWIN0PPS5                     BANKMASK(PORTWIN0PPS), 5, b
#define PORTWIN1PPS0                     BANKMASK(PORTWIN1PPS), 0, b
#define PORTWIN1PPS1                     BANKMASK(PORTWIN1PPS), 1, b
#define PORTWIN1PPS2                     BANKMASK(PORTWIN1PPS), 2, b
#define PORTWIN1PPS3                     BANKMASK(PORTWIN1PPS), 3, b
#define PORTWIN1PPS4                     BANKMASK(PORTWIN1PPS), 4, b
#define PORTWIN1PPS5                     BANKMASK(PORTWIN1PPS), 5, b
#define PORTWMD                          BANKMASK(PMD6), 0, b
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PRE0                             BANKMASK(ADPREL), 0, b
#define PRE1                             BANKMASK(ADPREL), 1, b
#define PRE10                            BANKMASK(ADPREH), 2, b
#define PRE11                            BANKMASK(ADPREH), 3, b
#define PRE12                            BANKMASK(ADPREH), 4, b
#define PRE2                             BANKMASK(ADPREL), 2, b
#define PRE3                             BANKMASK(ADPREL), 3, b
#define PRE4                             BANKMASK(ADPREL), 4, b
#define PRE5                             BANKMASK(ADPREL), 5, b
#define PRE6                             BANKMASK(ADPREL), 6, b
#define PRE7                             BANKMASK(ADPREL), 7, b
#define PRE8                             BANKMASK(ADPREH), 0, b
#define PRE9                             BANKMASK(ADPREH), 1, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS0                             BANKMASK(DAC1CON), 2, b
#define PSS1                             BANKMASK(DAC1CON), 3, b
